hotRoom6F_ABL_WTMesh/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 440.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    ground
    {
        type            omegaWallFunction;
        value           $internalField;
    }
     defaultFaces
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    wtwalls
    {
        type            symmetry;
    }

    buildingFaces_master
    {
              type            omegaWallFunction;
        value           $internalField;
    }
    buildingFaces_slave
    {
            type            omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
